tutorials/incompressible/simpleFoam/mixingPlaneAxial/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
1100
(
(4.50053 8.6999 -2.58726e-18)
(4.33085 8.37188 5.73386e-18)
(4.17349 8.0677 -3.29931e-18)
(4.02717 7.78485 0)
(3.89076 7.52115 -3.35131e-18)
(3.76329 7.27474 3.43885e-18)
(3.64391 7.04396 0)
(3.53186 6.82737 0)
...
)
;

boundaryField
{
    outflow
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector>
27
(
(3.339 0.331315 6.23548e-20)
(3.33038 0.40892 -1.08028e-19)
(3.31996 0.486304 0)
(3.30775 0.563425 -9.53784e-20)
(3.29375 0.64024 9.53786e-20)
(3.27795 0.716707 -8.73061e-20)
(3.26039 0.792789 -1.20674e-19)
(3.24106 0.868439 -1.28747e-19)
...
)
;
    }
    inflow
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -10;
        value           nonuniform List<vector>
17
(
(4.5947 8.88193 -0)
(3.75558 9.26799 -0)
(2.88442 9.57497 -0)
(1.98865 9.80027 -0)
(1.07591 9.94195 -5.869e-17)
(0.153994 9.99881 -0)
(-0.769238 9.97037 2.9345e-17)
(-1.68591 9.85686 -5.869e-17)
(-2.58819 9.65926 -0)
(-3.46839 9.37925 -0)
(-4.31901 9.01921 -1.1738e-16)
(-5.13277 8.58223 -0)
(-5.90274 8.07203 -2.3476e-16)
(-6.62235 7.49296 -0)
(-7.28547 6.84996 2.3476e-16)
(-7.88642 6.14852 -2.3476e-16)
(-8.4201 5.39463 -0)
)
;
    }
    upstreamPerio1
    {
        type            cyclicGgi;
        value           nonuniform List<vector>
25
(
(4.93064 0.431376 1.83307e-19)
(4.83491 0.422999 -6.66358e-19)
(4.74282 0.414946 2.53379e-19)
(4.65417 0.407186 1.18472e-19)
(4.56878 0.39972 -2.9159e-19)
(4.48646 0.392516 -1.03937e-19)
(4.40706 0.385566 2.67473e-19)
(4.33042 0.378864 -3.05282e-19)
...
)
;
    }
    upstreamPerio2
    {
        type            cyclicGgi;
        value           nonuniform List<vector>
25
(
(3.73542 3.24715 1.83307e-19)
(3.66289 3.1841 -6.66358e-19)
(3.59312 3.12346 2.53379e-19)
(3.52597 3.06507 1.18472e-19)
(3.46127 3.00884 -2.9159e-19)
(3.39891 2.95463 -1.03937e-19)
(3.33876 2.90233 2.67473e-19)
(3.28069 2.85186 -3.05282e-19)
...
)
;
    }
    upstreamMixingPlanePatch
    {
        type            mixingPlane;
        value           nonuniform List<vector>
27
(
(4.97469 0.493616 -9.07991e-20)
(4.96185 0.609239 -9.07991e-20)
(4.94633 0.724531 -9.07991e-20)
(4.92814 0.839431 -9.07991e-20)
(4.90727 0.953876 -9.07991e-20)
(4.88374 1.0678 -9.07991e-20)
(4.85757 1.18116 -9.07991e-20)
(4.82878 1.29387 -9.07991e-20)
...
)
;
    }
    downstreamMixingPlanePatch
    {
        type            mixingPlane;
        value           nonuniform List<vector>
17
(
(2.29695 4.44018 -9.07991e-20)
(1.87746 4.63317 -9.07991e-20)
(1.44196 4.78664 -9.07991e-20)
(0.994149 4.89927 -9.07991e-20)
(0.537861 4.9701 -9.07991e-20)
(0.0769836 4.99852 -9.07991e-20)
(-0.38455 4.9843 -9.07991e-20)
(-0.842803 4.92756 -9.07991e-20)
(-1.29387 4.82878 -9.07991e-20)
(-1.73389 4.68879 -9.07991e-20)
(-2.15912 4.50881 -9.07991e-20)
(-2.56593 4.29036 -9.07991e-20)
(-2.95085 4.0353 -9.07991e-20)
(-3.31059 3.74582 -9.07991e-20)
(-3.64209 3.42437 -9.07991e-20)
(-3.94251 3.07372 -9.07991e-20)
(-4.2093 2.69684 -9.07991e-20)
)
;
    }
    downstreamWall
    {
        type            symmetryPlane;
    }
    upstreamWall
    {
        type            symmetryPlane;
    }
    downstreamPerio1
    {
        type            cyclicGgi;
        value           nonuniform List<vector>
25
(
(4.8923 8.47371 4.79355e-19)
(4.70784 8.15422 -5.14849e-19)
(4.53679 7.85795 -9.49467e-19)
(4.37773 7.58245 1.85716e-18)
(4.22945 7.32562 -3.57695e-18)
(4.09087 7.08561 2.28869e-18)
(3.9611 6.86083 0)
(3.83931 6.64987 0)
...
)
;
    }
    downstreamPerio2
    {
        type            cyclicGgi;
        value           nonuniform List<vector>
25
(
(-8.47371 4.8923 4.79355e-19)
(-8.15422 4.70784 -5.14849e-19)
(-7.85795 4.53679 -9.49467e-19)
(-7.58245 4.37773 1.85716e-18)
(-7.32562 4.22945 -3.57695e-18)
(-7.08561 4.09087 2.28869e-18)
(-6.86083 3.9611 0)
(-6.64987 3.83931 0)
...
)
;
    }
}

// ************************************************************************* //
