tutorials/incompressible/simpleFoam/mixingPlaneAxial/0/save/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
    upstreamMixingPlanePatch
    {
        type mixingPlane;
    }
    downstreamMixingPlanePatch
    {
        type mixingPlane;
    }
    upstreamPerio1
    {
        type cyclicGgi;
    }
    upstreamPerio2
    {
        type cyclicGgi;
    }
    downstreamPerio1
    {
        type cyclicGgi;
    }
    downstreamPerio2
    {
        type cyclicGgi;
    }
    downstreamWall
    {
        type symmetryPlane;
    }
    upstreamWall
    {
        type symmetryPlane;
    }
    inflow
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -10;
        value           uniform (0 0 0);
    }
    outflow
    {
        type inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //

