tutorials/incompressible/simpleFoam/mixingPlaneAxial/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          BiCGStab;
        preconditioner  diagonal;
        //preconditioner  DILU;
        tolerance        1e-06;
        relTol           0;
    };
    p
    {
        solver          BiCGStab;
        preconditioner  diagonal;
        //preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
    }
    U
    {
        solver          BiCGStab;
        preconditioner  diagonal;
        //preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }
    k
    {
        solver          BiCGStab;
        preconditioner  diagonal;
        //preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }
    epsilon
    {
        solver          BiCGStab;
        preconditioner  diagonal;
        //preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
    nuTilda         0.7;
}

// ************************************************************************* //
